## :x: Apply Result





<pre><code>Error: Error creating Topic: googleapi: Error 409: Resource already exists in the project (resource=secrets-rotator-dead-letter).

  with google_pubsub_topic.secrets_rotator_dead_letter,
  on secrets-rotator.tf line 1, in resource &#34;google_pubsub_topic&#34; &#34;secrets_rotator_dead_letter&#34;:
   1: resource &#34;google_pubsub_topic&#34; &#34;secrets_rotator_dead_letter&#34; {


Error: Error creating service account: googleapi: Error 409: Service account secrets-rotator already exists within project projects/sap-kyma-prow.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;resourceName&#34;: &#34;projects/sap-kyma-prow/serviceAccounts/secrets-rotator@sap-kyma-prow.iam.gserviceaccount.com&#34;
  }
]
, alreadyExists

  with google_service_account.secrets-rotator,
  on secrets-rotator.tf line 11, in resource &#34;google_service_account&#34; &#34;secrets-rotator&#34;:
  11: resource &#34;google_service_account&#34; &#34;secrets-rotator&#34; {


Error: Error creating service account: googleapi: Error 409: Service account sa-keys-rotator already exists within project projects/sap-kyma-prow.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;resourceName&#34;: &#34;projects/sap-kyma-prow/serviceAccounts/sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com&#34;
  }
]
, alreadyExists

  with module.service_account_keys_rotator.google_service_account.service_account_keys_rotator,
  on ../../modules/rotate-service-account/main.tf line 5, in resource &#34;google_service_account&#34; &#34;service_account_keys_rotator&#34;:
   5: resource &#34;google_service_account&#34; &#34;service_account_keys_rotator&#34; {


Error: Error creating service account: googleapi: Error 409: Service account sa-keys-cleaner already exists within project projects/sap-kyma-prow.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;resourceName&#34;: &#34;projects/sap-kyma-prow/serviceAccounts/sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com&#34;
  }
]
, alreadyExists

  with module.service_account_keys_cleaner.google_service_account.service_account_keys_cleaner,
  on ../../modules/service-account-keys-cleaner/main.tf line 5, in resource &#34;google_service_account&#34; &#34;service_account_keys_cleaner&#34;:
   5: resource &#34;google_service_account&#34; &#34;service_account_keys_cleaner&#34; {
</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
module.service_account_keys_rotator.google_project_service_identity.pubsub_identity_agent: Refreshing state... [id=projects/sap-kyma-prow/services/pubsub.googleapis.com]
google_container_cluster.trusted_workload: Refreshing state... [id=projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow]
google_service_account.terraform_executor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.google_service_account.github_webhook_gateway: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.sa_gke_kyma_integration: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-gke-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com]
google_dns_managed_zone.build_kyma: Refreshing state... [id=projects/sap-kyma-prow/managedZones/build-kyma]
module.service_account_keys_rotator.data.google_project.project: Reading...
module.slack_message_sender.google_monitoring_alert_policy.slack_message_sender: Refreshing state... [id=projects/sap-kyma-prow/alertPolicies/17360148176148949136]
module.artifact_registry["modules-internal"].data.google_client_config.this: Reading...
module.service_account_keys_cleaner.data.google_project.project: Reading...
module.artifact_registry["modules-internal"].data.google_client_config.this: Read complete after 0s [id=projects/"sap-kyma-prow"/regions/"europe-west4"/zones/<null>]
module.slack_message_sender.google_service_account.slack_message_sender: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
module.cors_proxy.google_cloud_run_service.cors_proxy: Refreshing state... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/cors-proxy]
data.google_container_cluster.prow_k8s_cluster: Reading...
data.google_client_config.gcp: Reading...
data.google_client_config.gcp: Read complete after 0s [id=projects/"sap-kyma-prow"/regions/"europe-west4"/zones/<null>]
module.github_webhook_gateway.data.google_secret_manager_secret.gh_tools_kyma_bot_token: Reading...
module.github_webhook_gateway.data.google_project.project: Reading...
data.google_container_cluster.prow_k8s_cluster: Read complete after 0s [id=projects/sap-kyma-prow/locations/europe-west3-a/clusters/prow]
data.google_container_cluster.trusted_workload_k8s_cluster: Reading...
module.github_webhook_gateway.data.google_secret_manager_secret.gh_tools_kyma_bot_token: Read complete after 1s [id=projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token]
data.google_pubsub_topic.secret-manager-notifications-topic: Reading...
module.github_webhook_gateway.data.google_secret_manager_secret.webhook_token: Reading...
module.github_webhook_gateway.data.google_secret_manager_secret.webhook_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/sap-tools-github-backlog-webhook-secret]
module.slack_message_sender.data.google_secret_manager_secret.common_slack_bot_token: Reading...
data.google_pubsub_topic.secret-manager-notifications-topic: Read complete after 0s [id=projects/sap-kyma-prow/topics/secret-manager-notifications]
module.github_webhook_gateway.google_pubsub_topic.issue_labeled: Refreshing state... [id=projects/sap-kyma-prow/topics/issue-labeled]
data.google_container_cluster.untrusted_workload_k8s_cluster: Reading...
module.cors_proxy.data.google_iam_policy.noauth: Reading...
module.cors_proxy.data.google_project.project: Reading...
module.cors_proxy.data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
module.github_webhook_gateway.data.google_iam_policy.noauth: Reading...
module.github_webhook_gateway.data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
module.slack_message_sender.data.google_secret_manager_secret.common_slack_bot_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/common-slack-bot-token]
module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry: Refreshing state... [id=projects/sap-kyma-prow/locations/europe/repositories/modules-internal]
module.slack_message_sender.data.google_iam_policy.run_invoker: Reading...
google_container_node_pool.prowjobs_pool: Refreshing state... [id=projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow/nodePools/prowjobs-pool]
google_container_node_pool.components_pool: Refreshing state... [id=projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow/nodePools/components-pool]
module.slack_message_sender.data.google_iam_policy.run_invoker: Read complete after 0s [id=1526577908]
module.slack_message_sender.google_project_iam_member.project_run_invoker: Refreshing state... [id=sap-kyma-prow/roles/run.invoker/serviceAccount:slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
data.google_container_cluster.trusted_workload_k8s_cluster: Read complete after 1s [id=projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow]
google_project_iam_binding.dns_collector_container_analysis_occurrences_viewer: Refreshing state... [id=sap-kyma-prow/roles/containeranalysis.occurrences.viewer]
google_project_iam_binding.dns_collector_bucket_get: Refreshing state... [id=sap-kyma-prow/projects/sap-kyma-prow/roles/BucketGet]
data.google_container_cluster.untrusted_workload_k8s_cluster: Read complete after 0s [id=projects/sap-kyma-prow/locations/europe-west3/clusters/untrusted-workload-kyma-prow]
module.github_webhook_gateway.google_secret_manager_secret_iam_member.webhook_token_accessor: Refreshing state... [id=projects/sap-kyma-prow/secrets/sap-tools-github-backlog-webhook-secret/roles/secretmanager.secretAccessor/serviceAccount:github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.google_secret_manager_secret_iam_member.gh_tools_kyma_bot_token_accessor: Refreshing state... [id=projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token/roles/secretmanager.secretAccessor/serviceAccount:github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com]
google_project_iam_binding.dns_collector_dns_reader: Refreshing state... [id=sap-kyma-prow/roles/dns.reader]
module.service_account_keys_rotator.data.google_project.project: Read complete after 1s [id=projects/sap-kyma-prow]
google_service_account_iam_binding.terraform_workload_identity: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
module.github_webhook_gateway.data.google_project.project: Read complete after 1s [id=projects/sap-kyma-prow]
google_project_iam_member.terraform_executor_workloads_project_owner: Refreshing state... [id=sap-kyma-prow-workloads/roles/owner/serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
module.cors_proxy.data.google_project.project: Read complete after 0s [id=projects/sap-kyma-prow]
google_project_iam_member.terraform_executor_prow_project_owner: Refreshing state... [id=sap-kyma-prow/roles/owner/serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
module.cors_proxy.google_cloud_run_service_iam_policy.noauth: Refreshing state... [id=v1/projects/sap-kyma-prow/locations/europe-west3/services/cors-proxy]
module.slack_message_sender.google_secret_manager_secret_iam_member.slack_msg_sender_common_slack_bot_token_accessor: Refreshing state... [id=projects/sap-kyma-prow/secrets/common-slack-bot-token/roles/secretmanager.secretAccessor/serviceAccount:slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.google_pubsub_topic_iam_binding.issue_labeled: Refreshing state... [id=projects/sap-kyma-prow/topics/issue-labeled/roles/pubsub.publisher]
module.prow_gatekeeper.data.kubectl_file_documents.gatekeeper: Reading...
module.prow_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/prow/**.yaml"]: Reading...
module.prow_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/prow/**.yaml"]: Read complete after 0s [id=855a9e69c8456439c97de0f50933e09215da23ba88f3d11f61e9195746970b7a]
module.prow_gatekeeper.data.kubectl_path_documents.constraint_templates_path["../../../../opa/gatekeeper/constraint-templates/**.yaml"]: Reading...
module.service_account_keys_cleaner.data.google_project.project: Read complete after 2s [id=projects/sap-kyma-prow]
module.prow_gatekeeper.data.kubectl_file_documents.gatekeeper: Read complete after 1s [id=dd3443633a39325c8656d232ea51eb8515040007156fb9e6433fddd5276456b6]
module.prow_gatekeeper.data.kubectl_path_documents.constraint_templates_path["../../../../opa/gatekeeper/constraint-templates/**.yaml"]: Read complete after 0s [id=927f68fe2b1bee2bed9ddde896cce2ee56bbf0312119b6937b57278b94152090]
module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.member_service_account[0]: Refreshing state... [id=projects/sap-kyma-prow/locations/europe/repositories/modules-internal/roles/artifactregistry.writer/serviceAccount:kyma-submission-pipeline@kyma-project.iam.gserviceaccount.com]
module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.reader_service_accounts["klm-controller-manager@sap-ti-dx-kyma-mps-stage.iam.gserviceaccount.com"]: Refreshing state... [id=projects/sap-kyma-prow/locations/europe/repositories/modules-internal/roles/artifactregistry.reader/serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-stage.iam.gserviceaccount.com]
module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.reader_service_accounts["klm-controller-manager@sap-ti-dx-kyma-mps-prod.iam.gserviceaccount.com"]: Refreshing state... [id=projects/sap-kyma-prow/locations/europe/repositories/modules-internal/roles/artifactregistry.reader/serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-prod.iam.gserviceaccount.com]
module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.reader_service_accounts["klm-controller-manager@sap-ti-dx-kyma-mps-dev.iam.gserviceaccount.com"]: Refreshing state... [id=projects/sap-kyma-prow/locations/europe/repositories/modules-internal/roles/artifactregistry.reader/serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-dev.iam.gserviceaccount.com]
module.service_account_keys_rotator.google_project_iam_binding.pubsub_project_token_creator: Refreshing state... [id=sap-kyma-prow/roles/iam.serviceAccountTokenCreator]
module.github_webhook_gateway.google_cloud_run_service.github_webhook_gateway: Refreshing state... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/github-webhook-gateway]
module.prow_gatekeeper.kubectl_manifest.constraint_templates["apiVersion: templates.gatekeeper.sh/v1\nkind: ConstraintTemplate\nmetadata:\n  name: k8spsphostnetworkingports\n  annotations:\n    metadata.gatekeeper.sh/title: \"Host Networking Ports\"\n    metadata.gatekeeper.sh/version: 1.0.0\n    description: >-\n      Controls usage of host network namespace by pod containers. Specific\n      ports must be specified. Corresponds to the `hostNetwork` and\n      `hostPorts` fields in a PodSecurityPolicy. For more information, see\n      https://kubernetes.io/docs/concepts/policy/pod-security-policy/#host-namespaces\nspec:\n  crd:\n    spec:\n      names:\n        kind: K8sPSPHostNetworkingPorts\n      validation:\n        # Schema for the `parameters` field\n        openAPIV3Schema:\n          type: object\n          description: >-\n            Controls usage of host network namespace by pod containers. Specific\n            ports must be specified. Corresponds to the `hostNetwork` and\n            `hostPorts` fields in a PodSecurityPolicy. For more information, see\n            https://kubernetes.io/docs/concepts/policy/pod-security-policy/#host-namespaces\n          properties:\n            exemptImages:\n              description: >-\n                Any container that uses an image that matches an entry in this list will be excluded\n                from enforcement. Prefix-matching can be signified with `*`. For example: `my-image-*`.\n\n                It is recommended that users use the fully-qualified Docker image name (e.g. start with a domain name)\n                in order to avoid unexpectedly exempting images from an untrusted repository.\n              type: array\n              items:\n                type: string\n            hostNetwork:\n              description: \"Determines if the policy allows the use of HostNetwork in the pod spec.\"\n              type: boolean\n            min:\n              description: \"The start of the allowed port range, inclusive.\"\n              type: integer\n            max:\n              description: \"The end of the allowed port range, inclusive.\"\n              type: integer\n  targets:\n    - target: admission.k8s.gatekeeper.sh\n      rego: |\n        package k8spsphostnetworkingports\n\n        import data.lib.exempt_container.is_exempt\n\n        violation[{\"msg\": msg, \"details\": {}}] {\n            input_share_hostnetwork(input.review.object)\n            msg := sprintf(\"The specified hostNetwork and hostPort are not allowed, pod: %v. Allowed values: %v\", [input.review.object.metadata.name, input.parameters])\n        }\n\n        input_share_hostnetwork(o) {\n            not input.parameters.hostNetwork\n            o.spec.hostNetwork\n        }\n\n        input_share_hostnetwork(o) {\n            hostPort := input_containers[_].ports[_].hostPort\n            hostPort < input.parameters.min\n        }\n\n        input_share_hostnetwork(o) {\n            hostPort := input_containers[_].ports[_].hostPort\n            hostPort > input.parameters.max\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.containers[_]\n            not is_exempt(c)\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.initContainers[_]\n            not is_exempt(c)\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.ephemeralContainers[_]\n            not is_exempt(c)\n        }\n      libs:\n        - |\n          package lib.exempt_container\n\n          is_exempt(container) {\n              exempt_images := object.get(object.get(input, \"parameters\", {}), \"exemptImages\", [])\n              img := container.image\n              exemption := exempt_images[_]\n              _matches_exemption(img, exemption)\n          }\n\n          _matches_exemption(img, exemption) {\n              not endswith(exemption, \"*\")\n              exemption == img\n          }\n\n          _matches_exemption(img, exemption) {\n              endswith(exemption, \"*\")\n              prefix := trim_suffix(exemption, \"*\")\n              startswith(img, prefix)\n          }"]: Refreshing state... [id=/apis/templates.gatekeeper.sh/v1/constrainttemplates/k8spsphostnetworkingports]
module.prow_gatekeeper.kubectl_manifest.constraint_templates["# k8sallowedimages constraint template validates that a pod is not using an image that is not allowed.\n# It prevents the use of images with the :latest tag.\n# The k8sallowedimages accepts one parameter:\n# - images: a list of allowed image URLs. Each image URL must be a prefix of the image URL used in the Pod spec.\napiVersion: templates.gatekeeper.sh/v1beta1\nkind: ConstraintTemplate\nmetadata:\n  name: k8sallowedimages\nspec:\n  crd:\n    spec:\n      names:\n        kind: K8sAllowedImages\n      validation:\n        openAPIV3Schema:\n          properties:\n            images:\n              type: array\n              items:\n                type: string\n                description: A list of allowed image URLs. Each image URL must be a prefix of the image URL used in the Pod spec.\n  targets:\n    - target: admission.k8s.gatekeeper.sh\n      rego: |\n        package k8sallowedimages\n        # Check containers are not using latest tag.\n        violation[{\"msg\": msg}] {\n          container := input.review.object.spec.containers[_]\n          # Check if object is using an image with latest tag.\n          endswith(container.image, \":latest\")\n          msg := sprintf(\"container <%v> in namespace <%v> has image <%v> with latest tag, using latest tag is not allowed\", [container.name, input.review.object.metadata.namespace, container.image])\n        }\n\n        # Check init containers are not using latest tag.\n        violation[{\"msg\": msg}] {\n          container := input.review.object.spec.initContainers[_]\n          # Check if object is using an image with latest tag.\n          endswith(container.image, \":latest\")\n          msg := sprintf(\"container <%v> in namespace <%v> has image <%v> with latest tag, using latest tag is not allowed\", [container.name, input.review.object.metadata.namespace, container.image])\n        }\n        # Check containers are using allowed images.\n        violation[{\"msg\": msg}] {\n          container := input.review.object.spec.containers[_]\n          # Check object is using an image that is not allowed.\n          not strings.any_prefix_match(container.image, input.parameters.images)\n          msg := sprintf(\"container <%v> in namespace <%v> has an invalid image repo <%v>, allowed repos are %v\", [container.name, input.review.object.metadata.namespace, container.image, input.parameters.images])\n        }\n\n        # Check init containers are using allowed images.\n        violation[{\"msg\": msg}] {\n          container := input.review.object.spec.initContainers[_]\n          # Check object is using an image that is not allowed.\n          not strings.any_prefix_match(container.image, input.parameters.images)\n          msg := sprintf(\"container <%v> in namespace <%v> has an invalid image repo <%v>, allowed repos are %v\", [container.name, input.review.object.metadata.namespace, container.image, input.parameters.images])\n        }"]: Refreshing state... [id=/apis/templates.gatekeeper.sh/v1beta1/constrainttemplates/k8sallowedimages]
module.prow_gatekeeper.kubectl_manifest.constraint_templates["apiVersion: templates.gatekeeper.sh/v1\nkind: ConstraintTemplate\nmetadata:\n  name: k8spspallowprivilegeescalationcontainer\n  annotations:\n    metadata.gatekeeper.sh/title: \"Allow Privilege Escalation in Container\"\n    metadata.gatekeeper.sh/version: 1.0.0\n    description: >-\n      Controls restricting escalation to root privileges. Corresponds to the\n      `allowPrivilegeEscalation` field in a PodSecurityPolicy. For more\n      information, see\n      https://kubernetes.io/docs/concepts/policy/pod-security-policy/#privilege-escalation\nspec:\n  crd:\n    spec:\n      names:\n        kind: K8sPSPAllowPrivilegeEscalationContainer\n      validation:\n        openAPIV3Schema:\n          type: object\n          description: >-\n            Controls restricting escalation to root privileges. Corresponds to the\n            `allowPrivilegeEscalation` field in a PodSecurityPolicy. For more\n            information, see\n            https://kubernetes.io/docs/concepts/policy/pod-security-policy/#privilege-escalation\n          properties:\n            exemptImages:\n              description: >-\n                Any container that uses an image that matches an entry in this list will be excluded\n                from enforcement. Prefix-matching can be signified with `*`. For example: `my-image-*`.\n\n                It is recommended that users use the fully-qualified Docker image name (e.g. start with a domain name)\n                in order to avoid unexpectedly exempting images from an untrusted repository.\n              type: array\n              items:\n                type: string\n  targets:\n    - target: admission.k8s.gatekeeper.sh\n      rego: 

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

e_cloud_run_service_iam_member.service_account_keys_rotator_invoker will be created
  + resource "google_cloud_run_service_iam_member" "service_account_keys_rotator_invoker" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "europe-west4"
      + member   = (known after apply)
      + project  = (known after apply)
      + role     = "roles/run.invoker"
      + service  = "service-account-keys-rotator"
    }

  # module.service_account_keys_rotator.google_project_iam_member.service_account_keys_rotator will be created
  + resource "google_project_iam_member" "service_account_keys_rotator" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "sap-kyma-prow"
      + role    = "roles/iam.serviceAccountKeyAdmin"
    }

  # module.service_account_keys_rotator.google_project_iam_member.service_account_keys_rotator_secret_version_accessor will be created
  + resource "google_project_iam_member" "service_account_keys_rotator_secret_version_accessor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "sap-kyma-prow"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # module.service_account_keys_rotator.google_project_iam_member.service_account_keys_rotator_secret_version_adder will be created
  + resource "google_project_iam_member" "service_account_keys_rotator_secret_version_adder" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "sap-kyma-prow"
      + role    = "roles/secretmanager.secretVersionAdder"
    }

  # module.service_account_keys_rotator.google_project_iam_member.service_account_keys_rotator_secret_version_viewer will be created
  + resource "google_project_iam_member" "service_account_keys_rotator_secret_version_viewer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "sap-kyma-prow"
      + role    = "roles/secretmanager.viewer"
    }

  # module.service_account_keys_rotator.google_pubsub_subscription.service_account_keys_rotator will be created
  + resource "google_pubsub_subscription" "service_account_keys_rotator" {
      + ack_deadline_seconds       = 20
      + filter                     = "attributes.eventType = \"SECRET_ROTATE\""
      + id                         = (known after apply)
      + labels                     = {
          + "application_name" = "secrets-rotator"
        }
      + message_retention_duration = "604800s"
      + name                       = "secrets-rotator-service-account-keys-rotator"
      + project                    = (known after apply)
      + topic                      = "secret-manager-notifications"

      + dead_letter_policy {
          + dead_letter_topic     = (known after apply)
          + max_delivery_attempts = 15
        }

      + expiration_policy {
          + ttl = "31556952s"
        }

      + push_config {
          + push_endpoint = (known after apply)

          + oidc_token {
              + service_account_email = (known after apply)
            }
        }

      + retry_policy {
          + maximum_backoff = "600s"
          + minimum_backoff = "300s"
        }
    }

  # module.service_account_keys_rotator.google_service_account.service_account_keys_rotator will be created
  + resource "google_service_account" "service_account_keys_rotator" {
      + account_id  = "sa-keys-rotator"
      + description = "Identity of the service account keys rotator service."
      + disabled    = false
      + email       = (known after apply)
      + id          = (known after apply)
      + member      = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + unique_id   = (known after apply)
    }

Plan: 19 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ artifact_registry                              = {
      ~ modules-internal = {
          ~ artifact_registry_collection = {
                id                        = "projects/sap-kyma-prow/locations/europe/repositories/modules-internal"
                name                      = "modules-internal"
              ~ update_time               = "2023-08-21T00:46:29.441582Z" -> "2023-08-21T05:27:23.886289Z"
                # (14 unchanged elements hidden)
            }
        }
    }
  + secrets-rotator                                = {
      + account_id   = "secrets-rotator"
      + description  = null
      + disabled     = false
      + display_name = "Identity of the secrets rotator application"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + timeouts     = null
      + unique_id    = (known after apply)
    }
  + secrets_rotator_dead_letter_topic              = {
      + id                         = (known after apply)
      + kms_key_name               = null
      + labels                     = {
          + "application" = "secrets-rotator"
        }
      + message_retention_duration = "86600s"
      + message_storage_policy     = (known after apply)
      + name                       = "secrets-rotator-dead-letter"
      + project                    = (known after apply)
      + schema_settings            = (known after apply)
      + timeouts                   = null
    }
  + service_account_keys_cleaner                   = {
      + service_account_keys_cleaner_cloud_run_service = {
          + autogenerate_revision_name = false
          + id                         = (known after apply)
          + location                   = "europe-west4"
          + metadata                   = (known after apply)
          + name                       = "service-account-keys-cleaner"
          + project                    = (known after apply)
          + status                     = (known after apply)
          + template                   = [
              + {
                  + metadata = (known after apply)
                  + spec     = [
                      + {
                          + container_concurrency = (known after apply)
                          + containers            = [
                              + {
                                  + args           = null
                                  + command        = null
                                  + env            = [
                                      + {
                                          + name       = "APPLICATION_NAME"
                                          + value      = "secrets-rotator"
                                          + value_from = []
                                        },
                                      + {
                                          + name       = "COMPONENT_NAME"
                                          + value      = "service-account-keys-cleaner"
                                          + value_from = []
                                        },
                                      + {
                                          + name       = "LISTEN_PORT"
                                          + value      = "8080"
                                          + value_from = []
                                        },
                                    ]
                                  + env_from       = []
                                  + image          = "europe-docker.pkg.dev/kyma-project/prod/test-infra/service-account-keys-cleaner:v20230301-6267d66d"
                                  + liveness_probe = []
                                  + name           = (known after apply)
                                  + ports          = (known after apply)
                                  + resources      = (known after apply)
                                  + startup_probe  = (known after apply)
                                  + volume_mounts  = []
                                  + working_dir    = null
                                },
                            ]
                          + service_account_name  = (known after apply)
                          + serving_state         = (known after apply)
                          + timeout_seconds       = (known after apply)
                          + volumes               = []
                        },
                    ]
                },
            ]
          + timeouts                   = null
          + traffic                    = (known after apply)
        }
      + service_account_keys_cleaner_secheduler        = {
          + app_engine_http_target = []
          + attempt_deadline       = "320s"
          + description            = "Call service account keys cleaner service, to remove old versions of secrets"
          + http_target            = [
              + {
                  + body        = null
                  + headers     = null
                  + http_method = "GET"
                  + oauth_token = []
                  + oidc_token  = [
                      + {
                          + audience              = (known after apply)
                          + service_account_email = (known after apply)
                        },
                    ]
                  + uri         = (known after apply)
                },
            ]
          + id                     = (known after apply)
          + name                   = "service-account-keys-cleaner"
          + paused                 = (known after apply)
          + project                = (known after apply)
          + pubsub_target          = []
          + region                 = "europe-west4"
          + retry_config           = []
          + schedule               = "0 0 * * 1-5"
          + state                  = (known after apply)
          + time_zone              = "Etc/UTC"
          + timeouts               = null
        }
      + service_account_keys_cleaner_service_account   = {
          + account_id   = "sa-keys-cleaner"
          + description  = "Identity of the service account keys rotator service."
          + disabled     = false
          + display_name = null
          + email        = (known after apply)
          + id           = (known after apply)
          + member       = (known after apply)
          + name         = (known after apply)
          + project      = (known after apply)
          + timeouts     = null
          + unique_id    = (known after apply)
        }
    }
  + service_account_keys_rotator                   = {
      + service_account_keys_rotator_cloud_run_service   = {
          + autogenerate_revision_name = false
          + id                         = (known after apply)
          + location                   = "europe-west4"
          + metadata                   = (known after apply)
          + name                       = "service-account-keys-rotator"
          + project                    = (known after apply)
          + status                     = (known after apply)
          + template                   = [
              + {
                  + metadata = (known after apply)
                  + spec     = [
                      + {
                          + container_concurrency = (known after apply)
                          + containers            = [
                              + {
                                  + args           = null
                                  + command        = null
                                  + env            = [
                                      + {
                                          + name       = "APPLICATION_NAME"
                                          + value      = "secrets-rotator"
                                          + value_from = []
                                        },
                                      + {
                                          + name       = "COMPONENT_NAME"
                                          + value      = "service-account-keys-rotator"
                                          + value_from = []
                                        },
                                      + {
                                          + name       = "LISTEN_PORT"
                                          + value      = "8080"
                                          + value_from = []
                                        },
                                    ]
                                  + env_from       = []
                                  + image          = "europe-docker.pkg.dev/kyma-project/prod/test-infra/rotate-service-account:v20230307-cf164cd1"
                                  + liveness_probe = []
                                  + name           = (known after apply)
                                  + ports          = (known after apply)
                                  + resources      = (known after apply)
                                  + startup_probe  = (known after apply)
                                  + volume_mounts  = []
                                  + working_dir    = null
                                },
                            ]
                          + service_account_name  = (known after apply)
                          + serving_state         = (known after apply)
                          + timeout_seconds       = (known after apply)
                          + volumes               = []
                        },
                    ]
                },
            ]
          + timeouts                   = null
          + traffic                    = (known after apply)
        }
      + service_account_keys_rotator_service_account     = {
          + account_id   = "sa-keys-rotator"
          + description  = "Identity of the service account keys rotator service."
          + disabled     = false
          + display_name = null
          + email        = (known after apply)
          + id           = (known after apply)
          + member       = (known after apply)
          + name         = (known after apply)
          + project      = (known after apply)
          + timeouts     = null
          + unique_id    = (known after apply)
        }
      + service_account_keys_rotator_service_account_iam = {
          + condition = []
          + etag      = (known after apply)
          + id        = (known after apply)
          + member    = (known after apply)
          + project   = "sap-kyma-prow"
          + role      = "roles/iam.serviceAccountKeyAdmin"
        }
      + service_account_keys_rotator_subscription        = {
          + ack_deadline_seconds         = 20
          + bigquery_config              = []
          + cloud_storage_config         = []
          + dead_letter_policy           = [
              + {
                  + dead_letter_topic     = (known after apply)
                  + max_delivery_attempts = 15
                },
            ]
          + enable_exactly_once_delivery = null
          + enable_message_ordering      = null
          + expiration_policy            = [
              + {
                  + ttl = "31556952s"
                },
            ]
          + filter                       = "attributes.eventType = \"SECRET_ROTATE\""
          + id                           = (known after apply)
          + labels                       = {
              + "application_name" = "secrets-rotator"
            }
          + message_retention_duration   = "604800s"
          + name                         = "secrets-rotator-service-account-keys-rotator"
          + project                      = (known after apply)
          + push_config                  = [
              + {
                  + attributes    = null
                  + no_wrapper    = []
                  + oidc_token    = [
                      + {
                          + audience              = null
                          + service_account_email = (known after apply)
                        },
                    ]
                  + push_endpoint = (known after apply)
                },
            ]
          + retain_acked_messages        = null
          + retry_policy                 = [
              + {
                  + maximum_backoff = "600s"
                  + minimum_backoff = "300s"
                },
            ]
          + timeouts                     = null
          + topic                        = "secret-manager-notifications"
        }
    }
  ~ terraform_executor_gcp_prow_project_iam_member = {
      ~ etag      = "BwYDCkHZTFg=" -> "BwYDaCJwdso="
        id        = "sap-kyma-prow/roles/owner/serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
        # (4 unchanged elements hidden)
    }
google_service_account.secrets-rotator: Creating...
google_pubsub_topic.secrets_rotator_dead_letter: Creating...
module.service_account_keys_cleaner.google_service_account.service_account_keys_cleaner: Creating...
module.service_account_keys_rotator.google_service_account.service_account_keys_rotator: Creating...
module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry: Modifying... [id=projects/sap-kyma-prow/locations/europe/repositories/modules-internal]
module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry: Modifications complete after 0s [id=projects/sap-kyma-prow/locations/europe/repositories/modules-internal]

Error: Error creating Topic: googleapi: Error 409: Resource already exists in the project (resource=secrets-rotator-dead-letter).

  with google_pubsub_topic.secrets_rotator_dead_letter,
  on secrets-rotator.tf line 1, in resource "google_pubsub_topic" "secrets_rotator_dead_letter":
   1: resource "google_pubsub_topic" "secrets_rotator_dead_letter" {


Error: Error creating service account: googleapi: Error 409: Service account secrets-rotator already exists within project projects/sap-kyma-prow.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "resourceName": "projects/sap-kyma-prow/serviceAccounts/secrets-rotator@sap-kyma-prow.iam.gserviceaccount.com"
  }
]
, alreadyExists

  with google_service_account.secrets-rotator,
  on secrets-rotator.tf line 11, in resource "google_service_account" "secrets-rotator":
  11: resource "google_service_account" "secrets-rotator" {


Error: Error creating service account: googleapi: Error 409: Service account sa-keys-rotator already exists within project projects/sap-kyma-prow.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "resourceName": "projects/sap-kyma-prow/serviceAccounts/sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com"
  }
]
, alreadyExists

  with module.service_account_keys_rotator.google_service_account.service_account_keys_rotator,
  on ../../modules/rotate-service-account/main.tf line 5, in resource "google_service_account" "service_account_keys_rotator":
   5: resource "google_service_account" "service_account_keys_rotator" {


Error: Error creating service account: googleapi: Error 409: Service account sa-keys-cleaner already exists within project projects/sap-kyma-prow.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "resourceName": "projects/sap-kyma-prow/serviceAccounts/sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com"
  }
]
, alreadyExists

  with module.service_account_keys_cleaner.google_service_account.service_account_keys_cleaner,
  on ../../modules/service-account-keys-cleaner/main.tf line 5, in resource "google_service_account" "service_account_keys_cleaner":
   5: resource "google_service_account" "service_account_keys_cleaner" {


```

</details>

`

<!-- github-comment: {"Command":"apply","PRNumber":8730,"Program":"tfcmt","SHA1":"15c39ba5bf122eecdfd0fad882633b667bc5023e","Vars":{}} -->